* DONE Wire Client
  :LOGBOOK:
  CLOCK: [2013-05-23 Thu 17:20]--[2013-05-23 Thu 18:11] =>  0:51
  CLOCK: [2013-05-23 Thu 14:00]--[2013-05-23 Thu 15:56] =>  1:56
  :END:
* DONE Better logging
  :LOGBOOK:
  CLOCK: [2013-05-25 Sat 20:19]--[2013-05-25 Sat 20:35] =>  0:16
  CLOCK: [2013-05-25 Sat 19:35]--[2013-05-25 Sat 20:19] =>  0:44
  :END:
  I think only the store is properly logged.  The network bits should
  be as well.
* DONE Store event interface
  :LOGBOOK:
  CLOCK: [2013-05-26 Sun 02:12]--[2013-05-26 Sun 02:23] =>  0:11
  CLOCK: [2013-05-25 Sat 22:26]--[2013-05-25 Sat 23:41] =>  1:15
  :END:
  Store should export some sort of event interface.  We need this both
  for the status plugin and for the node adapter.
* DONE Implement Simple.close
  :LOGBOOK:
  CLOCK: [2013-05-25 Sat 23:45]--[2013-05-25 Sat 23:53] =>  0:08
  :END:
* DONE Store statistics
  :LOGBOOK:
  CLOCK: [2013-05-26 Sun 16:33]--[2013-05-26 Sun 16:47] =>  0:14
  CLOCK: [2013-05-26 Sun 15:05]--[2013-05-26 Sun 15:23] =>  0:18
  CLOCK: [2013-05-26 Sun 14:16]--[2013-05-26 Sun 15:03] =>  0:47
  :END:
  - [X] Event-handler
  - [X] Server
* DONE Monkey
  :LOGBOOK:
  CLOCK: [2013-05-26 Sun 21:53]--[2013-05-26 Sun 22:45] =>  0:52
  CLOCK: [2013-05-26 Sun 21:33]--[2013-05-26 Sun 21:45] =>  0:12
  CLOCK: [2013-05-26 Sun 19:43]--[2013-05-26 Sun 20:06] =>  0:23
  :END:
* DONE Status web interface
  :LOGBOOK:
  CLOCK: [2013-05-28 Tue 01:06]--[2013-05-28 Tue 02:18] =>  1:12
  CLOCK: [2013-05-28 Tue 00:54]--[2013-05-28 Tue 01:05] =>  0:11
  CLOCK: [2013-05-28 Tue 00:00]--[2013-05-28 Tue 00:53] =>  0:53
  CLOCK: [2013-05-27 Mon 18:13]--[2013-05-27 Mon 19:02] =>  0:49
  :END:
  - [X] Show log of events
  - [X] Count sets/gets
  - [X] Graph sets/gets
* TODO UDP Connections
  :LOGBOOK:
  CLOCK: [2013-06-24 Mon 04:49]--[2013-06-24 Mon 05:31] =>  0:42
  CLOCK: [2013-06-24 Mon 04:34]--[2013-06-24 Mon 04:46] =>  0:12
  CLOCK: [2013-06-24 Mon 04:26]--[2013-06-24 Mon 04:33] =>  0:07
  CLOCK: [2013-06-24 Mon 04:13]--[2013-06-24 Mon 04:21] =>  0:08
  CLOCK: [2013-06-24 Mon 01:15]--[2013-06-24 Mon 02:04] =>  0:49
  CLOCK: [2013-06-24 Mon 00:40]--[2013-06-24 Mon 00:41] =>  0:01
  CLOCK: [2013-06-23 Sun 23:55]--[2013-06-24 Mon 00:35] =>  0:40
  CLOCK: [2013-06-23 Sun 12:09]--[2013-06-23 Sun 12:19] =>  0:10
  CLOCK: [2013-06-23 Sun 10:26]--[2013-06-23 Sun 12:07] =>  1:41
  CLOCK: [2013-06-23 Sun 03:56]--[2013-06-23 Sun 04:12] =>  0:16
  CLOCK: [2013-06-23 Sun 03:32]--[2013-06-23 Sun 03:52] =>  0:20
  CLOCK: [2013-06-23 Sun 03:21]--[2013-06-23 Sun 03:26] =>  0:05
  CLOCK: [2013-06-23 Sun 02:55]--[2013-06-23 Sun 03:12] =>  0:17
  CLOCK: [2013-06-23 Sun 02:39]--[2013-06-23 Sun 02:45] =>  0:06
  CLOCK: [2013-06-23 Sun 01:10]--[2013-06-23 Sun 01:57] =>  0:47
  CLOCK: [2013-06-22 Sat 11:38]--[2013-06-22 Sat 11:47] =>  0:09
  CLOCK: [2013-06-22 Sat 10:05]--[2013-06-22 Sat 11:33] =>  1:28
  CLOCK: [2013-06-20 Thu 23:22]--[2013-06-20 Thu 23:47] =>  0:25
  CLOCK: [2013-06-20 Thu 23:10]--[2013-06-20 Thu 23:21] =>  0:11
  CLOCK: [2013-06-20 Thu 22:22]--[2013-06-20 Thu 23:05] =>  0:43
  CLOCK: [2013-06-20 Thu 16:00]--[2013-06-20 Thu 17:29] =>  1:29
  CLOCK: [2013-06-20 Thu 15:15]--[2013-06-20 Thu 15:57] =>  0:42
  CLOCK: [2013-06-20 Thu 00:11]--[2013-06-20 Thu 01:05] =>  0:54
  CLOCK: [2013-06-16 Sun 17:49]--[2013-06-16 Sun 18:43] =>  0:54
  CLOCK: [2013-06-04 Tue 13:34]--[2013-06-04 Tue 13:37] =>  0:03
  CLOCK: [2013-06-04 Tue 13:23]--[2013-06-04 Tue 13:31] =>  0:08
  CLOCK: [2013-06-04 Tue 00:05]--[2013-06-04 Tue 00:34] =>  0:29
  CLOCK: [2013-06-03 Mon 19:52]--[2013-06-03 Mon 19:54] =>  0:02
  CLOCK: [2013-06-03 Mon 19:40]--[2013-06-03 Mon 19:50] =>  0:00
  CLOCK: [2013-06-03 Mon 16:27]--[2013-06-03 Mon 16:53] =>  0:26
  CLOCK: [2013-06-03 Mon 12:01]--[2013-06-03 Mon 12:26] =>  0:25
  CLOCK: [2013-06-03 Mon 00:17]--[2013-06-03 Mon 00:23] =>  0:06
  CLOCK: [2013-06-01 Sat 23:44]--[2013-06-02 Sun 00:12] =>  0:28
  CLOCK: [2013-06-01 Sat 17:35]--[2013-06-01 Sat 17:43] =>  0:08
  CLOCK: [2013-06-01 Sat 16:46]--[2013-06-01 Sat 17:12] =>  0:26
  CLOCK: [2013-06-01 Sat 16:04]--[2013-06-01 Sat 16:45] =>  0:41
  CLOCK: [2013-05-31 Fri 20:13]--[2013-05-31 Fri 21:31] =>  1:18
  CLOCK: [2013-05-31 Fri 15:43]--[2013-05-31 Fri 16:13] =>  0:30
  CLOCK: [2013-05-30 Thu 01:37]--[2013-05-30 Thu 02:17] =>  0:40
  CLOCK: [2013-05-29 Wed 17:46]--[2013-05-29 Wed 18:38] =>  0:52
  CLOCK: [2013-05-29 Wed 15:32]--[2013-05-29 Wed 16:15] =>  0:43
  CLOCK: [2013-05-29 Wed 01:23]--[2013-05-29 Wed 01:27] =>  0:04
  CLOCK: [2013-05-28 Tue 19:41]--[2013-05-28 Tue 20:06] =>  0:25
  CLOCK: [2013-05-23 Thu 13:48]--[2013-05-23 Thu 13:56] =>  0:08
  CLOCK: [2013-05-22 Wed 03:48]--[2013-05-22 Wed 03:58] =>  0:10
  CLOCK: [2013-05-05 Sun 23:13]--[2013-05-05 Sun 23:30] =>  0:17
  CLOCK: [2013-03-22 Fri 13:24]--[2013-03-22 Fri 13:34] =>  0:10
  CLOCK: [2013-03-21 Thu 17:40]--[2013-03-21 Thu 18:22] =>  0:42
  CLOCK: [2013-03-21 Thu 17:30]--[2013-03-21 Thu 17:34] =>  0:04
  :END:
  Nodes should have a set of "neighbor" nodes which they propagate
  updates to, and request updates from.
  - [X] Version Clock held by the store
  - [X] Check that vector-clock has the right semantics
  - [X] Key history "from VC to VC"
  - [X] Node update messages should include a version clock and a
    multi-set
  - [X] Get rid of the Ltc.Adapter hierarchy
  - [X] SmallCheck tests for NodeProtocol
  - [X] Receive store changes from neighbours
  - [X] Store changes instead of values.
  - [X] Apply changes from neighbours
  - [X] Keep track of suspected neighbour version clock
  - [ ] ChangeSets (replaces DiffPacks)
  - [X] Propagate store changes to neighbours
  - [ ] Configurable update frequency
* DONE Abstract network interface
  :LOGBOOK:
  CLOCK: [2013-05-29 Wed 13:56]--[2013-05-29 Wed 15:02] =>  1:06
  CLOCK: [2013-05-29 Wed 03:16]--[2013-05-29 Wed 03:25] =>  0:09
  CLOCK: [2013-05-29 Wed 02:10]--[2013-05-29 Wed 03:02] =>  0:52
  CLOCK: [2013-05-29 Wed 01:59]--[2013-05-29 Wed 02:09] =>  0:10
  CLOCK: [2013-05-29 Wed 01:49]--[2013-05-29 Wed 01:56] =>  0:07
  CLOCK: [2013-05-29 Wed 01:27]--[2013-05-29 Wed 01:48] =>  0:21
  :END:
  - [X] Abstract location (host/port)
  - [X] Abstract serve/send/receive
  - [X] Use abstract interface
  - [X] Null interface
* DONE Report outline
  :LOGBOOK:
  CLOCK: [2013-05-30 Thu 09:30]--[2013-05-30 Thu 12:02] =>  2:32
  :END:
  - [X] General outline
  - [X] Assessment outline
* DONE Pick a nice palette
  :LOGBOOK:
  CLOCK: [2013-05-30 Thu 02:20]--[2013-05-30 Thu 02:34] =>  0:14
  :END:
  ColourLovers to the rescue!

  http://www.colourlovers.com/palette/1930/cheer_up_emo_kid
* DONE Get rid of GADTs
  :LOGBOOK:
  CLOCK: [2013-06-03 Mon 12:26]--[2013-06-03 Mon 15:00] =>  2:34
  :END:
* DONE Stringly typed Redis interface
  :LOGBOOK:
  CLOCK: [2013-06-03 Mon 15:04]--[2013-06-03 Mon 16:00] =>  0:56
  :END:
* TODO Draw DB tip
  :LOGBOOK:
  CLOCK: [2013-05-30 Thu 17:11]--[2013-05-30 Thu 17:24] =>  0:13
  CLOCK: [2013-05-30 Thu 16:00]--[2013-05-30 Thu 17:06] =>  1:06
  CLOCK: [2013-05-30 Thu 14:40]--[2013-05-30 Thu 15:10] =>  0:30
  CLOCK: [2013-05-30 Thu 13:04]--[2013-05-30 Thu 14:10] =>  1:06
  :END:
  - [X] Keys tip
  - [X] Values tip
  - [ ] Send all keys initially
* TODO Components configuration
  Some way to chose what parts of LTc to start.
* DONE Prettify events graph
  :LOGBOOK:
  CLOCK: [2013-05-30 Thu 17:27]--[2013-05-30 Thu 17:59] =>  0:32
  :END:
  http://code.shutterstock.com/rickshaw/tutorial/introduction.html
* TODO SQL Store Backend
  It's going to be SQLite, but it should work on any SQL database.
* DONE Custom Type Test
  :LOGBOOK:
  CLOCK: [2013-06-04 Tue 00:51]--[2013-06-04 Tue 01:15] =>  0:24
  :END:
* DONE Configurable monkey
  :LOGBOOK:
  CLOCK: [2013-06-07 Fri 19:45]--[2013-06-07 Fri 19:55] =>  0:10
  :END:
* TODO Expose monkey config in web interface
  :LOGBOOK:
  CLOCK: [2013-06-08 Sat 01:27]--[2013-06-08 Sat 01:56] =>  0:29
  CLOCK: [2013-06-08 Sat 00:00]--[2013-06-08 Sat 01:11] =>  1:11
  CLOCK: [2013-06-07 Fri 19:58]--[2013-06-07 Fri 19:59] =>  0:01
  :END:
  - [X] Expose config in status interface
  - [ ] Expose config in status UI
* TODO Set/get in web UI
* DONE Multi-entry changes
  :LOGBOOK:
  CLOCK: [2013-06-07 Fri 19:10]--[2013-06-07 Fri 19:16] =>  0:06
  CLOCK: [2013-06-01 Sat 23:42]--[2013-06-01 Sat 23:43] =>  0:01
  CLOCK: [2013-06-01 Sat 23:39]--[2013-06-01 Sat 23:42] =>  0:03
  CLOCK: [2013-06-01 Sat 22:44]--[2013-06-01 Sat 22:54] =>  0:10
  CLOCK: [2013-06-01 Sat 20:41]--[2013-06-01 Sat 21:42] =>  1:01
  :END:
  - [X] mset
  - [X] mget
* TODO Better merging
* DONE Recoverable store state
  :LOGBOOK:
  CLOCK: [2013-06-07 Fri 19:16]--[2013-06-07 Fri 19:26] =>  0:10
  :END:
  - [X] Was store closed cleanly?
* DONE Artificial delay network interface
  :LOGBOOK:
  CLOCK: [2013-06-04 Tue 13:14]--[2013-06-04 Tue 13:21] =>  0:07
  CLOCK: [2013-06-04 Tue 12:32]--[2013-06-04 Tue 13:13] =>  0:41
  :END:
  - [X] Configurable stub
  - [X] Artificial delays
* TODO dBay
  :LOGBOOK:
  CLOCK: [2013-06-23 Sun 14:36]--[2013-06-23 Sun 15:04] =>  0:28
  :END:
* TODO Test network interfaces
* TODO Expose net config in web interface
* TODO Temporal logic formalization
  Figure out what properties the whole thing should have, and what
  properties the individual components should have to be able to prove
  the bigger thing.
* TODO Check documentation
* TODO SQLite backend
* Final Report
  :LOGBOOK:
  CLOCK: [2013-06-18 Tue 11:03]--[2013-06-18 Tue 11:25] =>  0:22
  CLOCK: [2013-06-18 Tue 10:28]--[2013-06-18 Tue 10:44] =>  0:16
  CLOCK: [2013-06-18 Tue 09:29]--[2013-06-18 Tue 10:27] =>  0:58
  CLOCK: [2013-06-18 Tue 08:54]--[2013-06-18 Tue 09:19] =>  0:25
  CLOCK: [2013-06-18 Tue 07:59]--[2013-06-18 Tue 08:52] =>  0:53
  CLOCK: [2013-06-18 Tue 07:32]--[2013-06-18 Tue 07:49] =>  0:17
  CLOCK: [2013-06-18 Tue 07:09]--[2013-06-18 Tue 07:28] =>  0:19
  CLOCK: [2013-06-18 Tue 06:28]--[2013-06-18 Tue 06:56] =>  0:28
  CLOCK: [2013-06-18 Tue 05:27]--[2013-06-18 Tue 06:17] =>  0:50
  CLOCK: [2013-06-18 Tue 04:30]--[2013-06-18 Tue 05:09] =>  0:39
  CLOCK: [2013-06-18 Tue 03:03]--[2013-06-18 Tue 03:17] =>  0:14
  CLOCK: [2013-06-18 Tue 02:11]--[2013-06-18 Tue 02:57] =>  0:46
  CLOCK: [2013-06-18 Tue 00:51]--[2013-06-18 Tue 01:57] =>  1:06
  CLOCK: [2013-06-18 Tue 00:05]--[2013-06-18 Tue 00:41] =>  0:36
  CLOCK: [2013-06-17 Mon 23:40]--[2013-06-17 Mon 23:58] =>  0:18
  CLOCK: [2013-06-17 Mon 23:21]--[2013-06-17 Mon 23:33] =>  0:12
  CLOCK: [2013-06-17 Mon 18:08]--[2013-06-17 Mon 18:27] =>  0:19
  CLOCK: [2013-06-17 Mon 17:13]--[2013-06-17 Mon 17:55] =>  0:42
  CLOCK: [2013-06-17 Mon 16:19]--[2013-06-17 Mon 17:08] =>  0:49
  CLOCK: [2013-06-17 Mon 14:02]--[2013-06-17 Mon 14:20] =>  0:18
  CLOCK: [2013-06-17 Mon 13:34]--[2013-06-17 Mon 14:00] =>  0:26
  CLOCK: [2013-06-17 Mon 04:10]--[2013-06-17 Mon 04:44] =>  0:34
  CLOCK: [2013-06-17 Mon 03:26]--[2013-06-17 Mon 03:57] =>  0:31
  CLOCK: [2013-06-17 Mon 03:10]--[2013-06-17 Mon 03:26] =>  0:16
  CLOCK: [2013-06-17 Mon 00:46]--[2013-06-17 Mon 02:06] =>  1:20
  CLOCK: [2013-06-16 Sun 22:54]--[2013-06-17 Mon 00:23] =>  1:29
  CLOCK: [2013-06-16 Sun 22:39]--[2013-06-16 Sun 22:54] =>  0:15
  CLOCK: [2013-06-16 Sun 20:41]--[2013-06-16 Sun 20:50] =>  0:09
  CLOCK: [2013-06-16 Sun 19:25]--[2013-06-16 Sun 20:41] =>  1:16
  CLOCK: [2013-06-16 Sun 18:50]--[2013-06-16 Sun 19:08] =>  0:18
  CLOCK: [2013-06-16 Sun 03:04]--[2013-06-16 Sun 03:34] =>  0:30
  CLOCK: [2013-06-16 Sun 02:19]--[2013-06-16 Sun 02:59] =>  0:40
  CLOCK: [2013-06-16 Sun 01:59]--[2013-06-16 Sun 02:18] =>  0:19
  CLOCK: [2013-06-15 Sat 17:34]--[2013-06-15 Sat 18:29] =>  0:55
  CLOCK: [2013-06-15 Sat 15:01]--[2013-06-15 Sat 16:33] =>  1:32
  CLOCK: [2013-06-15 Sat 13:18]--[2013-06-15 Sat 14:25] =>  1:07
  CLOCK: [2013-06-14 Fri 16:49]--[2013-06-14 Fri 17:38] =>  0:49
  CLOCK: [2013-06-14 Fri 15:25]--[2013-06-14 Fri 16:38] =>  1:13
  CLOCK: [2013-06-13 Thu 01:32]--[2013-06-13 Thu 02:54] =>  1:22
  CLOCK: [2013-06-12 Wed 16:03]--[2013-06-12 Wed 17:44] =>  1:41
  CLOCK: [2013-06-12 Wed 14:11]--[2013-06-12 Wed 15:09] =>  0:58
  CLOCK: [2013-06-12 Wed 13:32]--[2013-06-12 Wed 13:47] =>  0:15
  CLOCK: [2013-06-12 Wed 13:14]--[2013-06-12 Wed 13:32] =>  0:18
  CLOCK: [2013-06-12 Wed 10:12]--[2013-06-12 Wed 11:11] =>  0:59
  CLOCK: [2013-06-12 Wed 02:56]--[2013-06-12 Wed 03:22] =>  0:26
  CLOCK: [2013-06-12 Wed 02:45]--[2013-06-12 Wed 02:52] =>  0:07
  CLOCK: [2013-06-09 Sun 20:45]--[2013-06-09 Sun 21:54] =>  1:09
  CLOCK: [2013-06-09 Sun 19:51]--[2013-06-09 Sun 20:31] =>  0:40
  CLOCK: [2013-06-09 Sun 18:07]--[2013-06-09 Sun 18:14] =>  0:07
  CLOCK: [2013-06-09 Sun 16:55]--[2013-06-09 Sun 18:05] =>  1:10
  CLOCK: [2013-06-06 Thu 13:37]--[2013-06-06 Thu 14:49] =>  1:12
  CLOCK: [2013-06-06 Thu 12:39]--[2013-06-06 Thu 13:09] =>  0:30
  CLOCK: [2013-06-06 Thu 10:20]--[2013-06-06 Thu 10:46] =>  0:26
  CLOCK: [2013-06-06 Thu 01:01]--[2013-06-06 Thu 01:16] =>  0:15
  CLOCK: [2013-06-04 Tue 19:07]--[2013-06-04 Tue 20:15] =>  1:08
  CLOCK: [2013-06-04 Tue 14:01]--[2013-06-04 Tue 17:16] =>  3:15
  :END:
* Presentation
  :LOGBOOK:
  CLOCK: [2013-06-23 Sun 18:59]--[2013-06-23 Sun 19:30] =>  0:31
  CLOCK: [2013-06-23 Sun 13:45]--[2013-06-23 Sun 14:12] =>  0:27
  CLOCK: [2013-06-23 Sun 13:03]--[2013-06-23 Sun 13:18] =>  0:15
  CLOCK: [2013-06-22 Sat 17:06]--[2013-06-22 Sat 17:08] =>  0:02
  CLOCK: [2013-06-21 Fri 13:00]--[2013-06-21 Fri 15:30] =>  2:30
  CLOCK: [2013-06-22 Sat 14:45]--[2013-06-22 Sat 16:30] =>  1:45
  CLOCK: [2013-06-22 Sat 13:40]--[2013-06-22 Sat 14:40] =>  1:00
  CLOCK: [2013-06-21 Fri 12:19]--[2013-06-21 Fri 12:31] =>  0:12
  CLOCK: [2013-06-21 Fri 11:44]--[2013-06-21 Fri 12:17] =>  0:33
  CLOCK: [2013-06-21 Fri 11:30]--[2013-06-21 Fri 11:43] =>  0:13
  CLOCK: [2013-06-21 Fri 11:16]--[2013-06-21 Fri 11:29] =>  0:13
  CLOCK: [2013-06-21 Fri 10:29]--[2013-06-21 Fri 10:45] =>  0:16
  CLOCK: [2013-06-21 Fri 10:20]--[2013-06-21 Fri 10:28] =>  0:08
  CLOCK: [2013-06-21 Fri 09:59]--[2013-06-21 Fri 10:19] =>  0:20
  CLOCK: [2013-06-21 Fri 09:44]--[2013-06-21 Fri 09:49] =>  0:05
  CLOCK: [2013-06-21 Fri 09:27]--[2013-06-21 Fri 09:44] =>  0:17
  CLOCK: [2013-06-21 Fri 09:05]--[2013-06-21 Fri 09:24] =>  0:19
  CLOCK: [2013-06-21 Fri 07:58]--[2013-06-21 Fri 08:49] =>  0:51
  CLOCK: [2013-06-21 Fri 07:22]--[2013-06-21 Fri 07:56] =>  0:34
  CLOCK: [2013-06-21 Fri 01:36]--[2013-06-21 Fri 03:06] =>  1:30
  CLOCK: [2013-06-21 Fri 00:48]--[2013-06-21 Fri 01:27] =>  0:39
  :END:
* Code improvements
  :LOGBOOK:
  CLOCK: [2013-06-23 Sun 15:24]--[2013-06-23 Sun 15:29] =>  0:05
  CLOCK: [2013-06-23 Sun 15:08]--[2013-06-23 Sun 15:22] =>  0:14
  CLOCK: [2013-06-10 Mon 01:23]--[2013-06-10 Mon 01:33] =>  0:10
  CLOCK: [2013-06-04 Tue 00:35]--[2013-06-04 Tue 00:37] =>  0:02
  CLOCK: [2013-06-03 Mon 16:56]--[2013-06-03 Mon 17:19] =>  0:23
  CLOCK: [2013-06-03 Mon 16:18]--[2013-06-03 Mon 16:26] =>  0:08
  CLOCK: [2013-06-03 Mon 16:06]--[2013-06-03 Mon 16:10] =>  0:04
  CLOCK: [2013-05-30 Thu 22:29]--[2013-05-30 Thu 22:34] =>  0:05
  CLOCK: [2013-05-26 Sun 02:26]--[2013-05-26 Sun 02:30] =>  0:04
  :END:
